KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТКач_ГодовойКвартальныйОтчет/КАНАТКач_ГодовойКвартальныйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТКач_ГодовойКвартальныйОтчет</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Documents/КАНАТ_РезультатИспытаний/КАНАТ_РезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАНАТ_РезультатИспытаний</name>
  <attributes>
    <name>Цех</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НТДПродукции</name>
    <type>
      <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Структура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПартияГотовойПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВлажностьФакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГотовойПродукцииИспытания</name>
    <type>
      <types>CatalogRef.КАНАТ_ВидыПродукцииКонтрольКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаИМетодикаИспытаний</name>
    <type>
      <types>CatalogRef.КАНАТ_ПрограммаИМетодикаИспытаний</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСертификатаКачества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовленияГотовойПродукции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБухты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаБухты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЭтапПроизводства2_2</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСырье</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСырье</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СырьеДляПечатнойФормы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>Сырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырья</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НТДСырья</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияСырья</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПримечаниеПоСырью</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатИспытаний</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзм</name>
      <type>
        <types>CatalogRef.КАНАТ_НТДРазмерности</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопустимоеОтклонение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьВПФ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТКач_ГодовойКвартальныйОтчет/Forms/Форма/Module.bsl
//++ Гурьев 24.10.23
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимостьКварталов();
	
	Год = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ЗаКварталПриИзменении(Элемент)
	ОбновитьВидимостьКварталов();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьКварталов()
	Элементы.Квартал.Видимость = ЗаКвартал;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДок = ПечатьНаСервере();
	//++Бит Трейгер П.М. 25.10.2024 Блок Качества. Переделка.
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева = 10;
	ТабДок.ПолеСправа = 5;
	//--Бит Трейгер П.М. 25.10.2024 Блок Качества. Переделка.
	Идентификатор = "ОтчетГодовойКвартальный";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = "Отчет годовой/квартальный";
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТКач_ГодовойКвартальныйОтчет.ПФ_MXL_ГодовойКвартальныйОтчет");
	
	Период = Новый СтандартныйПериод;
	
	Если Не ЗаКвартал Тогда
		Период.ДатаНачала = НачалоГода(Год);
		Период.ДатаОкончания = КонецГода(Год);
	Иначе
		Период.ДатаНачала = НачалоМесяца(ДобавитьМесяц(НачалоГода(Год), 3*Квартал));
		Период.ДатаОкончания = КонецМесяца(ДобавитьМесяц(НачалоГода(Год), 3*(Квартал) + 2));
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	Если ЗаКвартал Тогда 
		ОбластьШапка.Параметры.Дата = СтрШаблон("%1 квартал %2г.", Квартал + 1, Формат(Год, "ДФ=yyyy"));
	Иначе
		ОбластьШапка.Параметры.Дата = СтрШаблон("%1г.", Формат(Год, "ДФ=yyyy"));
	КонецЕсли;
	ТабДок.Вывести(ОбластьШапка);
	
	ВыборкаДанныеПФ = ПолучитьДанныеПФ(Период);
	ВывестиТаблицуВОтчет(ТабДок, Макет, ВыборкаДанныеПФ, 1);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
КонецФункции

&НаСервере
Функция ПолучитьДанныеПФ(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАНАТ_ВидыПродукцииКонтрольКачества.Ссылка КАК Вид,
	               |	КАНАТ_РезультатИспытаний.Ссылка КАК РезультатИспытаний,
	               |	КАНАТ_ВидыПродукцииКонтрольКачества.ЭтоГруппа КАК ЭтоГруппа
	               |ИЗ
	               |	Документ.КАНАТ_РезультатИспытаний КАК КАНАТ_РезультатИспытаний
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КАНАТ_ВидыПродукцииКонтрольКачества КАК КАНАТ_ВидыПродукцииКонтрольКачества
	               |		ПО КАНАТ_РезультатИспытаний.ВидГотовойПродукцииИспытания = КАНАТ_ВидыПродукцииКонтрольКачества.Ссылка
	               |ГДЕ
	               |	КАНАТ_РезультатИспытаний.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
				   |	И КАНАТ_РезультатИспытаний.Проведен = Истина
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РезультатИспытаний)
	               |ПО
	               |	Вид ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

&НаСервере
Процедура ВывестиТаблицуВОтчет(ТабДок, Макет, Выборка, Номер)
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			
			ОбластьТаблицаГруппа = Макет.ПолучитьОбласть("ОбластьТаблицаГруппа");
			ОбластьТаблицаГруппа.Параметры.Группа = Выборка.Вид;
			
			ТабДок.Вывести(ОбластьТаблицаГруппа);
			
			ВывестиТаблицуВОтчет(ТабДок, Макет, Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), Номер);
			
		Иначе
			
			ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
			ОбластьТаблицаСтрока.Параметры.Номер        = Номер;
			ОбластьТаблицаСтрока.Параметры.Номенклатура = Выборка.Вид;
			ОбластьТаблицаСтрока.Параметры.Количество   = Выборка.РезультатИспытаний;
			
			Номер = Номер + 1;
			
			ТабДок.Вывести(ОбластьТаблицаСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
